# Pandas

In [ ]:
!pip install pandas

In [2]:
import pandas as pd

dataframe-ის შექმნა dictionary-ის გამოყენებით.
- key - სვეტის სახელი
- value - სვეტის მონაცემები list-ის სახით

In [3]:
pd.DataFrame({
    "first_name": ["Abraham", "George", "Thomas"],
    "last_name": ["Lincoln", "Washgington", "Jefferson"],
    "age": [230, 300, 200]
})

  first_name    last_name  age
0    Abraham      Lincoln  230
1     George  Washgington  300
2     Thomas    Jefferson  200

dataframe-ის შექმნა მატრიცით.

In [4]:
df = pd.DataFrame([
    ["Abraham", "Lincoln", 230.0],
    ["Thomas", "Jefferson", 200],
    ["George", "washington", None],
    ["Franklin", "Roosevelt", 120]
], columns=["first_name", "last_name", "age"])

df

  first_name   last_name    age
0    Abraham     Lincoln  230.0
1     Thomas   Jefferson  200.0
2     George  washington    NaN
3   Franklin   Roosevelt  120.0

მონაცემების შენახვა შესაძლებელია სხვადასხვა ფორმატებში (json, excel, csv...), რისთვისაც არსებობს სხვადასხვა მეთოდები:
- df.to_csv("file.csv")
- df.to_json("file.json")
- df.to_excel("file.xlsx")
- ...

In [5]:
df.to_csv("./data/data.csv", index=False)

**ინდექსები**

dataframe-ის შექმნისას თითოეულ სტრიქონს ენიჭება ინდექსი - რიცხვი 0-დან n-მდე (n = სვეტების რაოდენობა), რომელიც შეგვიძლია გამოვიყენოთ ფილტრაციისთვის.

ინდექსის შეცვლა შესაძლებელია .set_index() მეთოდის გამოყენებით.

In [6]:
df.shape

(4, 3)

In [7]:
df["id"] = list(map(lambda x: "00" + str(x), list(range(0, df.shape[0]))))

In [8]:
# copy the existing df, set a new index and return
df.set_index("id", inplace=False)

# modify the existing df
df.set_index("id", inplace=True)

***dataframe-ის სხვადასხვა მეთოებს შესაძლოა ქონდეთ inplace პარამეტრი, რომელიც განსაზღვრავს მეთოდი დააბრუნებს ახალ dataframe-ს თუ შეცვლის არსებულს.***

In [9]:
df

    first_name   last_name    age
id
000    Abraham     Lincoln  230.0
001     Thomas   Jefferson  200.0
002     George  washington    NaN
003   Franklin   Roosevelt  120.0

მონაცემებზე წვდომა:

In [10]:
df["first_name"]
df.first_name

id
000     Abraham
001      Thomas
002      George
003    Franklin
Name: first_name, dtype: object

**loc** vs **iloc**
- loc  - მუშაობს ინდექსის და სვეტის დასახელებებზე
- iloc - მუშაობს რიცხვით ინდექსებზე

In [11]:
df.loc["000", "first_name"]

df.iloc[0, -1]

np.float64(230.0)

dataframe-ში ცარიელი უჯრები წარმოდგენილია სპეციალური მონაცემთა ტიპით - NaN

In [12]:
# drop all rows with at least one NaN value in any column
df.dropna()

    first_name  last_name    age
id
000    Abraham    Lincoln  230.0
001     Thomas  Jefferson  200.0
003   Franklin  Roosevelt  120.0

In [13]:
# replace all nan values with specific value
df["age"] = df["age"].fillna(df["age"].mean())

In [14]:
df

    first_name   last_name         age
id
000    Abraham     Lincoln  230.000000
001     Thomas   Jefferson  200.000000
002     George  washington  183.333333
003   Franklin   Roosevelt  120.000000

ლოგიკური ოპერატორები:

- or  - |
- and - &
- not - ~

dataframe-ში მონაცემების გაფილტრვა შესაძლებელია სხვადასხვა ლოგიკური პირობებით

In [15]:
df[[True, True, False, False]]

    first_name  last_name    age
id
000    Abraham    Lincoln  230.0
001     Thomas  Jefferson  200.0

In [16]:
df[(df.age < 200) | (df.age > 300)]

    first_name   last_name         age
id
002     George  washington  183.333333
003   Franklin   Roosevelt  120.000000

მონაცემების წაკითხვა ფაილიდან:

pandas შესაძლებლობას გვაძლევს მონაცემები წავიკითხოთ სხვადასხვა ტიპის ფაილებიდან, რისთვისაც გვაქვს სხვადასხვა მეთოდები:
- .read_csv("file.csv")
- .read_excel("file.xlsx")
- ...

In [17]:
df = pd.read_csv("./data/grades.csv")

In [18]:
df.columns

Index(['Last name', ' "First name"', ' "SSN"', '        "Test1"', ' "Test2"',
       ' "Test3"', ' "Test4"', ' "Final"', ' "Grade"'],
      dtype='object')

In [19]:
new_cols = []
for c in df.columns:
    new_cols.append(c.replace("\"", "").strip())
new_cols

['Last name',
 'First name',
 'SSN',
 'Test1',
 'Test2',
 'Test3',
 'Test4',
 'Final',
 'Grade']

In [20]:
new_cols = [c.replace("\"", "").strip() for c in df.columns]
df.columns = new_cols
df

,Last name,First name,SSN,Test1,Test2,Test3,Test4,Final,Grade
0,Alfalfa,"""Aloysius""","""123-45-6789""",40.0,90.0,100.0,83.0,49.0,"""D-"""
1,Alfred,"""University""","""123-12-1234""",41.0,97.0,96.0,97.0,48.0,"""D+"""
2,Gerty,"""Gramma""","""567-89-0123""",41.0,80.0,60.0,40.0,44.0,"""C"""
3,Android,"""Electric""","""087-65-4321""",42.0,23.0,36.0,45.0,47.0,"""B-"""
4,Bumpkin,"""Fred""","""456-78-9012""",43.0,78.0,88.0,77.0,45.0,"""A-"""
5,Rubble,"""Betty""","""234-56-7890""",44.0,90.0,80.0,90.0,46.0,"""C-"""
6,Noshow,"""Cecil""","""345-67-8901""",45.0,11.0,-1.0,4.0,43.0,"""F"""
7,Buff,"""Bif""","""632-79-9939""",46.0,20.0,30.0,40.0,50.0,"""B+"""
8,Airpump,"""Andrew""","""223-45-6789""",49.0 1.0,90.0,100.0,83.0,"""A""",NaN
9,Backus,"""Jim""","""143-12-1234""",48.0,1.0,97.0,96.0,97.0,"""A+"""
10,Carnivore,"""Art""","""565-89-0123""",44.0,1.0,80.0,60.0,40.0,"""D+"""
11,Dandy,"""Jim""","""087-75-4321""",47.0,1.0,23.0,36.0,45.0,"""C+"""
12,Elephant,"""Ima""","""456-71-9012""",45.0,1.0,78.0,88.0,77.0,"""B-"""
13,Franklin,"""Benny""","""234-56-2890""",50.0,1.0,90.0,80.0,90.0,"""B-"""
14,George,"""Boy""","""345-67-3901""",40.0,1.0,11.0,-1.0,4.0,"""B"""
15,Heffalump,"""Harvey""","""632-79-9439""",30.0,1.0,20.0,30.0,40.0,"""C"""

In [21]:
df[~(df["Test2"] < 20) & (df["Test3"] < 40)]

,Last name,First name,SSN,Test1,Test2,Test3,Test4,Final,Grade
3,Android,"""Electric""","""087-65-4321""",42.0,23.0,36.0,45.0,47.0,"""B-"""
7,Buff,"""Bif""","""632-79-9939""",46.0,20.0,30.0,40.0,50.0,"""B+"""

In [22]:
df["Test2"].agg(["mean", "sum"])

mean     36.625
sum     586.000
Name: Test2, dtype: float64

In [23]:
df["Test2"].argmax()

np.int64(1)